{
    "title": "Retro PC",
    "subtitle": "Working at the Dream Center during Summer 2024",
    "date": "Jul 8, 2024",
    "image": "https://lh3.googleusercontent.com/pw/AP1GczP2FOgH4B2hxDH0PrunzPf_ZTLC3KDKxlMCtcaKyNBx5gZa3PARSmiR3srXKwT3fUT_kSPlRSzS4CJ_ZOYsx1j_pnBxQRZJ8oA3tdWKCWNA6jp7fk3n=w2400",
    "content": "One Christmas, our uncle got us a little Raspberry Pi that could run hundreds of NES and SNES games: everything from the original Super Mario Bros. to some obscure indie game with the most ridiculous plot. We were very grateful for it, but over the years we have had it, the poor thing has only gotten slower (we suspect because it never turns off). It got so bad that my brother and I were just playing Tetris together and it was still lagging. This is when I decided I needed to do something.\n\nWe had an ancient PC sitting under the desk upstairs. It was an HP prebuilt with an Intel Core 2 Quad, 8 gigs of RAM, and that I had swapped in from another system. My mom had used it originally for work before I found it in the attic as an 8th grader. I tinkered around with it, installed Windows 10, and made it into my PC, but I eventually upgraded to a modern system, and this poor PC was relegated back to storage.\n\nWell, after 4 more years of sitting gathering dust, I finally had a reason to give this PC new life. I experimented with different operating systems - some made specifically for retro games, some about as barebones as it gets (**cough** arch **cough**) - but the HP motherboard must have had some sort of protection on it because none of them would boot (despite working perfectly fine on my other computers). I finally decided to install Windows XP, a truly retro decision, and it worked perfectly. There was no way to connect to the internet; I had to transfer all the files from my main PC to a USB drive and then to the retro PC. Drivers were hard to come by and emulators that supported Windows XP still were even harder, but I did eventually get everything working. Now our family can play all the best NES and SNES games without any lagging."
}
